crazyman9870/Computer-Systems-MSP430/Snake/RBX430_lcd.c
//	RBX430_lcd.c	08/06/2014
//******************************************************************************
//******************************************************************************
//	LL        CCCCC     DDCDDD
//	LL       CC   CC    DD   DD
//	LL      CC          DD    DD
//	LL      CC          DD    DD
//	LL      CC          DD    DD
//	LL       CC   CC    DD   DD
//	LLLLLL    CCCCC     DDDDDD
//******************************************************************************
//******************************************************************************
///	Author:			Paul Roper, Brigham Young University
//	Revision:		1.0		03/05/2012	RBX430-1
//					1.1		06/01/2012	divu8, image1, image2
//					1.2		09/17/2012	fill fixes
//					1.3		11/07/2012	lcd_bitImage, lcd_wordImage
//					1.4		11/25/2012	lcd_points 0-15
//					1.5		04/08/2013	_printfi minimal routine
//										lcd_printf / printf
//										lcd_sprintf / sprintf
//										override fputc, fputs in stdio library
//							07/23/2013	string.h included
//							08/08/2013	%2d fixed
//							11/19/2013	hex length limited to fieldSize
//					1.6					lcd_rectange uses int
//					1.7		08/06/2014	lcd_init initializes ports 2-4
//
//	Description:	Controller firmware for YM160160C/ST7529 LCD
//
//	Built with CCSv5.2 w/cgt 4.2.0
//******************************************************************************
//
#include <stdio.h>
#include <stdlib.h>
#include <stdarg.h>
#include <string.h>

#include "msp430x22x4.h"
#include "RBX430-1.h"
#include "RBX430_lcd.h"

static volatile uint8 lcd_dmode;			// lcd mode
static volatile uint8 lcd_y;				// row (0-159)
static volatile uint8 lcd_x;				// column (0-159)
static volatile uint8 char_cnt;				// character counter
static volatile char* buffer_ptr;			// sprintf buffer ptr

static void WriteCmd(uint8 c);
static uint8 ReadData(void);
static uint16 ReadDataWord(void);
static void WriteData(uint8 c);
static void WriteDataWord(uint16 data);
static void DelayMs(uint16 time);

//******************************************************************************
//******************************************************************************
//	Function: void lcd_init()
//
//	PreCondition: none
//	Input: none
//	Output: none
//	Side Effects: none
//	Overview: resets LCD, initializes PMP
//
//	Note: Sitronix	ST7529 controller drive
//					1/160 Duty, 1/13 Bias
//
#define LCD_DELAY	50				// 50 ms

uint8 lcd_init(void)
{
	int i;

	// configure P2
	P2SEL = 0x00;				// GPIO
	P2OUT = 0x00;				// turn off all output pins
	P2REN = 0x00;				// no pull-ups
	P2DIR = 0xff;				// P2.0-7 output

	// configure P3
	P3SEL &= ~(LCD_A0|LCD_RW);		// P3.0=LCD_A0, P3.3=LCD_RW
	P3REN &= ~(LCD_A0|LCD_RW);		// no pull-ups
	P3OUT &= ~(LCD_A0|LCD_RW);
	P3DIR |= (LCD_A0|LCD_RW);

	// configure P4
	P4SEL &= ~(LCD_E|BK_LGT);		// P4.4=BK_LGT, P4.7=LCD_E
	P4REN &= ~(LCD_E|BK_LGT);		// no pull-ups
	P4OUT &= ~(LCD_E|BK_LGT);
	P4DIR |= (LCD_E|BK_LGT);

	LCD_A0_H;					// set A0 high (data)
	LCD_RW_H;					// set RW high (read)
	DelayMs(LCD_DELAY);

	// Hold in reset
	LCD_A0_L;					// set A0 low (command) RESET
	DelayMs(LCD_DELAY);

	// Release from reset
	LCD_A0_H;					// set A0 high (data)
	DelayMs(LCD_DELAY);

	WriteCmd(0x30);				// Ext = 0

	WriteCmd(0x94);				// Sleep Out

	WriteCmd(0xd1);				// OSC On
	WriteCmd(0x20);				// Power Control Set
		WriteData(0x08);		// Booster Must Be On First
	DelayMs(2);

	WriteCmd(0x20);				// Power Control Set
		WriteData(0x0b);		// Booster, Regulator, Follower ON

	WriteCmd(0x81);				// Electronic Control
		WriteData(VOP_CODE & 0x3f);
		WriteData(VOP_CODE >> 6);

	WriteCmd(0xca);				// Display Control
		WriteData(0x00);		// CLD=0
		WriteData(0x27);		// Duty=(160/4-1)=39
		WriteData(0x00);		// FR Inverse-Set Value ???

	WriteCmd(0xa6);				// Normal Display

	WriteCmd(0xbb);				// COM Scan Direction
		WriteData(0x01);		// 0->79 159->80

	WriteCmd(0xbc);				// Data Scan Direction
		WriteData(0x01);		// CI=0, LI=1
		WriteData(0x01);		// CLR=1 (P3/P2/P1)
		WriteData(0x01);		// 2B3P

	WriteCmd(0x31);				// Ext = 1

	WriteCmd(0x20);				// set gray level for odd frames
	i = 0;						// for (i = 0; i < 32; i += 2) WriteData(i);
	do
	{
		WriteData(i);
	} while ((i += 2) < 32);

	WriteCmd(0x21);				// set gray level for even frames
	i = 1;						// for (i = 1; i < 32; i += 2) WriteData(i);
	do
	{
		WriteData(i);
	} while ((i += 2) < 32);

	WriteCmd(0x32);				// Analog Circuit Set
		WriteData(0x00);		// OSC Frequency =000 (Default)
		WriteData(0x01);		// Booster Efficiency=01(Default)
		WriteData(0x01);		// Bias=1/13

	WriteCmd(0x34);				// Software init

	WriteCmd(0x30);				// Ext = 0
	WriteCmd(0xaf);				// Display On

	lcd_dmode = 0;
	lcd_y = 0;
	lcd_x = 0;					// column (0-159)
	return 0;
} // end  lcd_init


//******************************************************************************
//	Sitronix ST7529 controller functions
//
//	void WriteCmd(uint8 c)
//	int ReadData(void)
//	void WriteData(uint8 c)
//	void WriteDataWord(uint16 w)
//
//		A0	RW	A0 + ~RW	Function
//		--	--	--------	-----------------
//		0	0	   1		Control Write
//		0	1	   0		Control Read (Reset)
//		1	0      1		Display Write
//		1	1	   1		Display Read
//
//
void WriteCmd(uint8 c)
{
	P2DIR = 0xff;		// output to P2
	P2OUT = c;			// set data on output lines
	LCD_RW_L;			// set RW low (write)
	LCD_A0_L;			// set A0 low (command)
	LCD_E_H;			// toggle E
	LCD_E_L;
	return;
} // end WriteCmd


uint8 ReadData(void)
{
	uint8 data;

	P2DIR = 0x00;		// input from P2
	LCD_A0_H;			// set A0 high (data)
	LCD_RW_H;			// set RW high (read)
	LCD_E_H;			// toggle E
	_no_operation();	// nop
	data = P2IN;		// read data
	LCD_E_L;
	return data;
} // end ReadData


void WriteData(uint8 c)
{
	P2DIR = 0xff;		// output to P2
	P2OUT = c;			// set data on output lines
	LCD_A0_H;			// set A0 high (data)
	LCD_RW_L;			// set RW low (write)
	LCD_E_H;			// toggle E
	LCD_E_L;
	return;
} // end WriteData


uint16 ReadDataWord(void)
{
	uint16 data;

	P2DIR = 0x00;		// input from P2
	LCD_A0_H;			// set A0 high (data)
	LCD_RW_H;			// set RW high (read)
	LCD_E_H;			// toggle E
	_no_operation();	// nop
	data = P2IN;		// read high data
	LCD_E_L;
	LCD_E_H;			// toggle E
	_no_operation();	// nop
	data = (data << 8) + P2IN;		// read low data
	LCD_E_L;
	return data;
} // end ReadDataWord


