crazyman9870/Computer-Systems-MSP430/Snake/RBX430_lcd.c
void WriteDataWord(uint16 data)
{
	P2DIR = 0xff;		// output to P2
	P2OUT = data >> 8;	// set data on output lines
	LCD_A0_H;			// set A0 high (data)
	LCD_RW_L;			// set RW low (write)
	LCD_E_H;			// toggle E
	LCD_E_L;
	_no_operation();	// nop
	P2OUT = data;		// set data on output lines
	LCD_E_H;			// toggle E
	LCD_E_L;
	return;
} // end WriteDataWord


//******************************************************************************
//	Function: void DelayMs(WORD time)
//
//	PreCondition: none
//	Input: time - delay in ms
//	Output: none
//	Side Effects: none
//	Overview: delays execution on time specified in ms
//
//	Note: none
//
//******************************************************************************
//
#define DELAY_1MS	100

void DelayMs(uint16 time)
{
	volatile uint16 delay;

	// save current clock speed
	volatile uint8 saved_BCSCTL1 = BCSCTL1;
	volatile uint8 saved_DCOCTL = DCOCTL;

	// select 1MHz
	BCSCTL1 = CALBC1_1MHZ;			// Set range 1MHz
	DCOCTL = CALDCO_1MHZ;			// Set DCO step + modulation

	// delay (time) ms
	do
	{
		for (delay = DELAY_1MS; delay > 0;) --delay;
	} while (time--);

	// restore clocks
	BCSCTL1 = saved_BCSCTL1;
	DCOCTL = saved_DCOCTL;
	return;
} // end DelayMs


//******************************************************************************
//	fast uint8 / 3
//
//	q = (n >> 2) + (n >> 4);		// q = n*0.0101 (approx).
//	q += (q >> 4);					// q = n*0.01010101.
//	q += (q >> 8);					// (not needed for uint8/3)
//	r = n - q * 3;					// 0 <= r <= 15.
//	return q + ((11 * r) >> 5);		// Returning q + r/3.
//
//	See Hacker's Delight, Henry S. Warren, Jr., 10-3
//
#if 0
unsigned divu3(unsigned n)
{
	unsigned q, r, t;
	q = (n >> 2);					// q = n*0.01
	q += (q >> 2);					// q = n*0.0101
	q += (q >> 4);					// q = n*0.01010101
	r = n - ((q << 1) + q);			// 0 <= r <= 15.
	t = r << 3;						// Returning q + r/3.
	return q + ((r + r + r + t) >> 5);
} // end divu3
#else
const char dv3[] = {
		0,0,0, 1,1,1, 2,2,2, 3,3,3, 4,4,4, 5,5,5, 6,6,6, 7,7,7, 8,8,8,
		9,9,9, 10,10,10, 11,11,11, 12,12,12, 13,13,13, 14,14,14, 15,15,15,
		16,16,16, 17,17,17, 18,18,18, 19,19,19, 20,20,20, 21,21,21,
		22,22,22, 23,23,23, 24,24,24, 25,25,25, 26,26,26, 27,27,27,
		28,28,28, 29,29,29, 30,30,30, 31,31,31, 32,32,32, 33,33,33,
		34,34,34, 35,35,35, 36,36,36, 37,37,37, 38,38,38, 39,39,39,
		40,40,40, 41,41,41, 42,42,42, 43,43,43, 44,44,44, 45,45,45,
		46,46,46, 47,47,47, 48,48,48, 49,49,49, 50,50,50, 51,51,51,
		52,52,52, 53,53,53 };

#define divu3(n)	dv3[n]
#endif


//******************************************************************************
//	set lcd x, y
//
void lcd_set_x_y(uint8 x, uint8 y)
{
	WriteCmd(0x75);					// set line address
		WriteData(y);				// from line 0 - 159
		WriteData(0x9f);

	WriteCmd(0x15);					// set column address
		WriteData(divu3(x));		// from col 0 - 160/3
		WriteData(0x35);
	return;
} // end lcd_set_x_y


//******************************************************************************
//	lcd read word
//
uint16 lcd_read_word(int16 column, int16 row)
{
	WriteCmd(0x75);					// set line address
		WriteData(row);				// from line 0 - 159
		WriteData(0x9f);

	WriteCmd(0x15);					// set column address
		WriteData(column);			// from col 0 - 160/3
		WriteData(0x35);
	WriteCmd(0x5d);					// RAMRD - read from memory
	ReadData();						// Dummy read
//	return (ReadData() << 8) + ReadData();
	return ReadDataWord();
} // end lcd_read_word


//******************************************************************************
//	lcd write word
//
void lcd_write_word(int16 column, int16 row, uint16 data)
{
	WriteCmd(0x75);					// set line address
		WriteData(row);				// from line 0 - 159
		WriteData(0x9f);

	WriteCmd(0x15);					// set column address
		WriteData(column);			// from col 0 - 160/3
		WriteData(0x35);
	WriteCmd(0x5c);					// RAMWR - write to memory
	WriteData(data >> 8);			// write high byte
	WriteData(data & 0x00ff);		// write low byte
	return;
} // end lcd_write_word


//******************************************************************************
//	clear lcd screen
//
void lcd_clear()
{
	lcd_set(0xffdf);				// clear lcd
} // end lcd_clear


//******************************************************************************
//	set lcd screen
//
void lcd_set(uint16 value)
{
	int i;

	lcd_set_x_y(0, 0);			// upper right corner
	WriteCmd(0x5c);				// start write

	// whole screen - rows x columns
//	for (i = 0; i < 160 * (divu3((160*2))); i++)
//	for (i = 160 * (divu3((160*2))); i > 0; --i)
//	for (i = 160 * (160 * 2 / 3); i > 0; --i)

	i = 160 * (160 * 2 / 3);
	do
	{
		WriteDataWord(value);
	} while (--i);
	lcd_dmode = 0;				// reset mode
	lcd_y = 0;					// lower left hand corner
	lcd_x = 0;
	return;
} // end  lcd_set


//******************************************************************************
//	R/W lcd point
//
//	IN:		x = column coordinate
//			y = row coordinate
//			flag =	0000 0000
//			         \\\\ \\\\
//			          \\\\ \\\\_ 0=erase, 1=draw
//			           \\\\ \\\_ \
//			            \\\\ \\_  Point size
//			             \\\\ \_ /
//			              \\\\
//			               \\\\_ 0=no fill, 1=fill
//			                \\\_
//			                 \\_
//			                  \_ 1 = read
//
//																oooooo
//						-ooo-							ooooo	oooooo
//						ooooo					oooo	ooooo	oooooo
//				-o-		ooXoo			ooo		oooo	ooXoo	ooXooo
//				oXo		ooooo	oo		oXo		oXoo	ooooo	oooooo
//		o		-o-		-ooo-	Xo		ooo		oooo	ooooo	oooooo
//
//		0/1		2/3		4/5		6/7		8/9		10/11	12/13	14/15
//		SINGLE	TRIPLE	PENT	DOUBLEX	TRIPLEX	QUADX	PENTX	SEXTX
//
//	return results
//
const unsigned int px_on[] = { 0xffc0, 0xf81f, 0x07ff };
const unsigned int px_off[] = { 0x001f, 0x07c0, 0xf800 };

uint8 lcd_point(int16 x, int16 y, int8 flag)
{
	uint16 pixel, xd3;

	// return 1 if out of range
	if ((x < 0) || (x >= HD_X_MAX)) return 1;
	if ((y < 0) || (y >= HD_Y_MAX)) return 1;

	if (flag & 0x80)
	{
		flag = 0x80;						// set flag = 0x80 to read
	}
	else
	{
		uint16 on_off = flag & 0x01;
		flag &= 0x000f;
		switch (flag)
		{
			case 0:								// single
			case 1:
				flag &= 0x0001;
				break;

