crazyman9870/Computer-Systems-MSP430/Snake/RBX430_lcd.c
			case 4:								// penta
			case 5:
				lcd_point(x-1, y+2, on_off);	//	-ooo-
				lcd_point(x, y+2, on_off);		//	ooooo
				lcd_point(x+1, y+2, on_off);	//	ooXoo
												//	ooooo
				lcd_point(x-2, y+1, on_off);	//	-ooo-
				lcd_point(x+2, y+1, on_off);
				lcd_point(x-2, y, on_off);
				lcd_point(x+2, y, on_off);
				lcd_point(x-2, y-1, on_off);
				lcd_point(x+2, y-1, on_off);

				lcd_point(x-1, y-2, on_off);
				lcd_point(x, y-2, on_off);
				lcd_point(x+1, y-2, on_off);

				lcd_point(x-1, y+1, on_off);	//	ooo
				lcd_point(x+1, y+1, on_off);	//	oXo
				lcd_point(x-1, y-1, on_off);	//	ooo
				lcd_point(x+1, y-1, on_off);

			case 2:								// triple
			case 3:
				lcd_point(x, y+1, on_off);		//	-o-
				lcd_point(x-1, y, on_off);		//	oXo
				lcd_point(x, y, on_off);		//	-o-
				lcd_point(x+1, y, on_off);
				lcd_point(x, y-1, on_off);
				return 0;

			default:							// square points
			{
				int i,j;
				int size = (flag >> 1) - 1;
				int end = (size >> 1);
				int start = end - size + 1;
				for (i = start; i <= end; ++i)
				{
					for (j = start; j <= end; ++j)
					{
						lcd_point(x + i, y + j, on_off);
					}
				}
				return 0;
			}
		}
	}

	// process point
	x = 159 - x;						// translate to lcd coordinates
	lcd_set_x_y(x, y);					// upper right corner

	// read 3 points from lcd
	WriteCmd(0xe0);						// RMWIN - read and modify write
	ReadData();							// Dummy read
	pixel = ReadDataWord();				// Start read cycle for pixel 2/1/0

	// turn point on/off
	xd3 = divu3(x);
	xd3 = x - xd3 - xd3 - xd3;			// x % 3 = (x - divu3(x) * 3)
	switch (flag)
	{
		case 0:							// turn point off
			pixel |= px_off[xd3];
			break;

		case 1:							// turn point on
			pixel &= px_on[xd3];
			break;

		default:
		case 128:						// read point
			WriteCmd(0xee);				// RMWOUT - cancel read modify write mode
//			return (pixel & px_off[xd3]) ? 0 : 1;
			return ((pixel & px_off[xd3]) == px_off[xd3]) ? 0 : 1;
	}
	// write pixels back to lcd
	WriteDataWord(pixel);				// Write pixels back
	WriteCmd(0xee);						// RMWOUT - cancel read modify write mode
	return 0;							// return success
} // end lcd_point


//******************************************************************************
//	Display Image Functions:
//
//	uint8 lcd_image(const uint8* image, int16 x, int16 y)
//	uint8 lcd_bitImage(const uint8* image, int16 x, int16 y, uint8 flag)
//	uint8 lcd_wordImage(const uint16* image, int16 x, int16 y, uint8 flag)
//
//******************************************************************************
//	uint8 lcd_image(const uint8* image, int16 x, int16 y)
//
//	IN:		const char* image ->	uint8 width
//									uint8 height
//									(8-bit column value) x width
//									...
//									... height % 8 rows.
//
//	OUT:	Return 0
//
uint8 lcd_image(const uint8* image, int16 x, int16 y)
{
	int16 x1, y1, data, mask;
	int16 right = x + *image++;			// stop at right side of image
	int16 bottom = y;					// finish at bottom
	y += *image++;						// get top of image

	while (y > bottom)					// display from top down
	{
		for (x1 = x; x1 < right; ++x1)	// display from left to right
		{
			data = *image++;			// get image byte
			y1 = y;
//			for (mask = 0x80; mask; mask >>= 1)
			mask = 0x80;
			do
			{
				if (data & mask) lcd_point(x1, --y1, 1);
				else if (1) lcd_point(x1, --y1, 0);
			} while (mask >>= 1);
		}
		y -= 8;							// next row
	}
	return 0;
} // end lcd_image


//******************************************************************************
//	output LCD B/W bit image
//
//	flag = 0	blank image
//	       1	output LCD RAM image
//	       2	fill image area
//
//	IN:		const char* image ->	uint8 width
//									uint8 height
//									(8-bit row value) x (width % 8)
//									...
//									... height rows.
//
//			x position must be divisible by 3
//
//	OUT:	Return 0
//
uint8 lcd_bitImage(const uint8* image, int16 x, int16 y, uint8 flag)
{
	int16 i, data, index;
	uint8 bits, mask;
	int16 width = *image++;				// get width/height
	int16 height = *image++;
	int16 bottom = y;

	x += width - 1;						// move to top, left (make 0 based)
	y += height;

	while (y > bottom)					// display from top down
	{
		lcd_set_x_y(159 - x, y);		// upper right corner
		WriteCmd(0x5c);					// write to memory

		data = 0x0000;					// fill
		switch (flag)
		{
			case 0:
				data = 0xffdf;			// erase

			case 2:
			{
				for (i = width; i > 0; i -= 3)	// display from right to left
				{
					WriteDataWord(data);
				}
			}
			break;

			default:
			case 1:
			{
				image += (width >> 3);		// point to end of image line
				mask = 0x80;
				data = 0xffdf;				// assume all off
				index = 0;

				for (i = width; i > 0; --i)		// display from right to left
				{
					mask <<= 1;					// adjust mask
					if (mask == 0)
					{
						mask = 0x01;			// reset mask
						bits = *--image;		// get next data byte
					}
					if (bits & mask)
					{
						if (index == 0) data &= 0xffe0;
						else if (index == 1) data &= 0xf83f;
						else data &= 0x07df;
					}
					if (++index == 3)
					{
						WriteDataWord(data);
						data = 0xffdf;			// assume all off
						index = 0;
					}
				}
				if (index) WriteDataWord(data);	// flush data
				image += (width >> 3);			// point to end of image line
			}
			break;
		}
		y--;									// next row
	}
	return 0;
} // end lcd_bitImage


//******************************************************************************
//	output 4-bit gray-scale LCD ram image (3 4-bit pixels / word)
//
//	flag = 0	blank image
//	       1	output LCD RAM image
//	       2	fill image area
//	       3	reverse output LCD RAM image
//
//	IN:		const uint16* image ->	uint16 width
//									uint16 height
//									(16-bit LCD RAM value) x (width / 3) R to L order
//									...
//									... height rows.
//
//	OUT:	Return 0;
//
//	Note:	1. x position must be divisible by 3
//			2. 0xccFF used to compress 0 values
//			3. RAM value = 3P/2B (1111 1222 2203 3333)
//			4. ccf- = special run of 3 pixels
//					ccff = run of 3 pixels off
//					ccfe = run of 3 pixels on
//					ccf0,pppp = run of pppp pixels
//
#define M2B3P(P0,P1,P2) ((((P0^0xff)&0x1f)<<5)+((P1^0xff)&0x1f))<<6)+((P2^0xff)&0x1f)

