crazyman9870/Computer-Systems-MSP430/Snake/RBX430_lcd.c
uint8 lcd_wordImage(const uint16* image, int16 x, int16 y, uint8 flag)
{
	int16 x1, reverse = 0;
	int16 runCnt = 0;
	uint16 runPixels;

	int16 width = *image++;				// get width/height
	int16 height = *image++;
	int16 bottom = y;

	x += width - 1;						// move to top, left (make 0 based)
	y += height;
//	width = divu3((width + 2));			// 3 pixels per 2 bytes (round up)

	if (flag == 3)
	{
		flag = 1;
		reverse = 1;
	}
	while (y > bottom)					// display from top down
	{
		lcd_set_x_y(159 - x, y);		// upper right corner
		WriteCmd(0x5c);					// write to memory

		for (x1 = width; x1 > 0; x1 -= 3)			// display from right to left
		{
			switch (flag)						// switch on mode
			{
				case 0:
					WriteDataWord(0xffdf);		// write 3 pixels off
					break;

				case 1:
					// check for run of 3 pixels
					if (runCnt)
					{
						--runCnt;
						WriteDataWord(reverse ? ~runPixels : runPixels);		// output 3 run pixels
						break;
					}

					// check for special code (ccfx)
					if (*image & 0x0020)
					{
						runCnt = *image++;				// get special code
						switch (runCnt & 0x00ff)		// switch to special case
						{
							case 0x00ff:
								runPixels = 0xffdf;		// 3 pixels off
								break;

							case 0x00fe:
								runPixels = 0x0000;		// 3 pixels on
								break;

							case 0x00f0:
							default:
								runPixels = ~*image++;	// run of 3 pixels
								break;
						}
						runCnt >>= 8;					// get run count
//						++x1;						// setup 1st output
						x1 += 3;						// setup 1st output
						break;
					}

					WriteDataWord(reverse ? *image++ : ~*image++);
					break;

				default:
				case 2:
					WriteDataWord(0x0000);		// write 3 pixels on (fill)
					break;
			}
		}
		y--;									// next row
	}
	return 0;
} // end lcd_wordImage


//******************************************************************************
//	Fill Image
//
//	IN:		x, y			lower right coordinates
//			width,height	area to blank
//			flag = 0		blank image
//	    		   1		(unused)
//	    		   2		fill image area
//
//	OUT:	return 0;
//
uint8 lcd_fillImage(int16 x, int16 y, uint16 width, uint16 height, uint8 flag)
{
	uint16 area[2];
	area[0] = width;
	area[1] = height;
	return lcd_wordImage(area, x, y, flag);
}


//******************************************************************************
//	Blank Image
//
//	IN:		x, y			lower right coordinates
//			width,height	area to blank
//
//	OUT:	return 0;
//
uint8 lcd_blank(int16 x, int16 y, uint16 width, uint16 height)
{
	int16 x0, y0;

	for (x0 = x + width - 1; x0 >= x; --x0)
	{
		for (y0 = y + height - 1; y0 >= y; --y0)
		{
			lcd_point(x0, y0, 0);
		}
	}
	return 0;
} // end lcd_blank


//******************************************************************************
//	change lcd volume (brightness)
//
//		VOP = 3.6 + (volume x 0.04)
//
//		default	3.6 + (257 x 0.04) = 13.88v
//				3.6 + (335 x 0.04) = 17.0v
//				3.6 + (360 x 0.04) = 18.0v
//		max		3.6 + (410 x 0.04) = 20.0v	(DO NOT EXCEED!)
//
void lcd_volume(uint16 volume)
{
	if (volume > 410) volume = 410;		// limit to 20.0v
	WriteCmd(0x81);						// Electronic Control
		WriteData(volume & 0x3f);
		WriteData(volume >> 6);
	return;
} // end lcd_volume


//******************************************************************************
//	Turn ON/OFF LCD backlight
//
void lcd_backlight(uint8 backlight)
{
	if (backlight)
	{
		BACKLIGHT_ON;					// turn on backlight
	}
	else
	{
		BACKLIGHT_OFF;					// turn off backlight
	}
	return;
} // end lcd_backlight


//******************************************************************************
//	Display Mode
//
//	IN:		mode
//	OUT:	old mode
//
//	xxxx xxxx
//	 \\\\ \\\\___ LCD_PROPORTIONAL		proportional font
//	  \\\\ \\\___ LCD_REVERSE_FONT		reverse font
//	   \\\\ \\___ LCD_2X_FONT			2x font
//	    \\\\ \___ LCD_OR_CHAR			write char in OR mode
//	     \\\\____
//	      \\\____
//	       \\____
//	        \____ clear bis
//
//	~mode = Turn OFF mode bit(s)
//
uint8 lcd_mode(int8 mode)
{
	if (mode)
	{
		// set/reset mode bits
		if (mode & 0x80)
		{
			lcd_dmode &= mode;			// reset bits
		}
		else
		{
			lcd_dmode |= mode;			// set mode bits
		}
	}
	else
	{
		lcd_dmode = 0;
	}
	return lcd_dmode;
} // end lcd_mode


//******************************************************************************
//	draw circle of radius r0 and center x0,y0
//
void lcd_circle(int16 x0, int16 y0, uint16 r0, uint8 pen)
{
	int16 x, y, d;
	int16 i, j;

	x = x0;
	y = y0 + r0;
	d =  3 - r0 * 2;

	do
	{
		if (pen & FILL)
		{
			for (i = x0 - (x - x0); i <= x; ++i)
    		{
        		lcd_point(i, y, pen);
    			lcd_point(i,  y0 - (y - y0), pen);
    		}
    		for (j = y0 - (x - x0); j <= y0 + (x - x0); ++j)
    		{
    			for (i = x0 - (y - y0); i <= x0 + (y - y0); ++i)
    			{
    				lcd_point(i, j, pen);
    			}
    		}
		}
		else
		{
			lcd_point(x, y, pen);
    		lcd_point(x, y0 - (y - y0), pen);
    		lcd_point(x0 - (x - x0), y, pen);
    		lcd_point(x0 - (x - x0), y0 - (y - y0), pen);

    		lcd_point(x0 + (y - y0), y0 + (x - x0), pen);
    		lcd_point(x0 + (y - y0), y0 - (x - x0), pen);
    		lcd_point(x0 - (y - y0), y0 + (x - x0), pen);
    		lcd_point(x0 - (y - y0), y0 - (x - x0), pen);
		}
		if (d < 0)
		{
			d = d +  ((x - x0) << 2) + 6;
		}
		else
		{
			d = d + (((x - x0) - (y - y0)) << 2) + 10;
			--y;
		}
		++x;
	} while ((x - x0) <= (y - y0));
	return;
} // end lcd_circle


//******************************************************************************
//	draw square of radius r0 and center x0,y0
//
//	pen =	0000 0000
//	         \\\\ \\\\
//	          \\\\ \\\\_ 0=erase, 1=draw
//	           \\\\ \\\_ 0=single, 1=double
//	            \\\\ \\_ 0=no fill, 1=fill
//
void lcd_square(int16 x0, int16 y0, uint16 r0, uint8 pen)
{
	lcd_rectangle(x0 - r0, y0 - r0, r0 + r0 + 1, r0 + r0 + 1, pen);
	return;
} // end lcd_square


//******************************************************************************
//	draw star of radius r0 and center x0,y0
//
//	pen =	0000 0000
//	         \\\\ \\\\
//	          \\\\ \\\\_ 0=erase, 1=draw
//	           \\\\ \\\_ 0=single, 1=double
//	            \\\\ \\_ 0=no fill, 1=fill
//
void lcd_star(int16 x0, int16 y0, uint16 r0, uint8 pen)
{
	int16  r = 0;

	do
	{
		uint16 y1 = y0 + r;
		uint16 y2 = y0 - r;

		lcd_point(x0 - r0, y1, pen);
		lcd_point(x0 + r0, y1, pen);
		lcd_point(x0 - r0, y2, pen);
		lcd_point(x0 + r0, y2, pen);
		if (r0)
		{
			lcd_point(x0 - r0 + 1, y1, pen);
			lcd_point(x0 + r0 - 1, y1, pen);
			lcd_point(x0 - r0 + 1, y2, pen);
			lcd_point(x0 + r0 - 1, y2, pen);
		}

		++r;
	} while (r0--);
	return;
} // end lcd_star


