crazyman9870/Computer-Systems-MSP430/Snake/RBX430_lcd.c
//******************************************************************************
//	draw triangle of radius r0 and center x0,y0
//
//	pen =	0000 0000
//	         \\\\ \\\\
//	          \\\\ \\\\_ 0=erase, 1=draw
//	           \\\\ \\\_ 0=single, 1=double
//	            \\\\ \\_ 0=no fill, 1=fill
//			     \\\\ \_ 0=
//
void lcd_triangle(int16 x0, int16 y0, uint16 r0, uint8 pen)
{
	int16  x, y;
	uint8 fill = 1;						// always fill bottom
	y = y0 - r0;						// start at bottom
	r0 <<= 1;							// radius * 2
	do
	{
		lcd_point(x0 - (r0 >> 1), y, pen);	// draw end points
		lcd_point(x0 + (r0 >> 1), y, pen);
		if (fill)						// if bottom or fill
		{
			for (x = (x0 - (r0 >> 1) + 1); x <= (x0 + (r0 >> 1) - 1); ++x)
			{
				lcd_point(x, y, pen);
			}
		}
		++y;
		fill = pen & FILL;
	} while (r0--);
	return;
} // end lcd_triangle


//******************************************************************************
//	draw diamond of radius r and center x,y
//
//	pen =	0000 0000
//	         \\\\ \\\\
//	          \\\\ \\\\_ 0=erase, 1=draw
//	           \\\\ \\\_ 0=single, 1=double
//	            \\\\ \\_ 0=no fill, 1=fill
//			     \\\\ \_ 0=
//
void lcd_diamond(int16 x, int16 y, uint16 r, uint8 pen)
{
	int16  x0, y0, y1;
	uint8 fill = pen & FILL;			// always fill bottom
	y0 = y1 = y;						// start in middle
	do
	{
		lcd_point(x - r, y0, pen);		// draw middle points
		lcd_point(x + r, y0, pen);
		lcd_point(x - r, y1, pen);		// draw middle points
		lcd_point(x + r, y1, pen);
		if (fill)						// if bottom or fill
		{
			for (x0 = (x - r + 1); x0 <= (x + r - 1); ++x0)
			{
				lcd_point(x0, y0, pen);
				lcd_point(x0, y1, pen);
			}
		}
		++y0;
		--y1;
	} while (r--);
	return;
} // end lcd_diamond


//******************************************************************************
//	draw rectangle at lower left (x0,y0) of width w, height h
//
//	pen =	0000 0000
//	         \\\\ \\\\
//	          \\\\ \\\\_ 0=erase, 1=draw
//	           \\\\ \\\_ \
//	            \\\\ \\_  pen size
//	             \\\\ \_ /
//	              \\\\
//	               \\\\_ 0=no fill, 1=fill
//
#if 0
void lcd_rectangle(int16 x, int16 y, uint16 w, uint16 h, uint8 pen)
{
	int16  x0, y0;
	uint8 fill_flag = (pen & FILL) ? 1 : 0;

	if (w-- == 0) return;
	for (y0 = y; y0 < y + h; ++y0)
	{
		lcd_point(x, y0, pen);
		if ((y0 == y) || (y0 == y + h - 1) || fill_flag)
		{
			for (x0 = x + 1; x0 < x + w; ++x0)
			{
				lcd_point(x0, y0, pen);
			}
		}
		lcd_point(x + w, y0, pen);
	}
	return;
} // end lcd_rectangle
#else
void lcd_rectangle(int16 x, int16 y, int16 w, int16 h, uint8 pen)
{
	uint8 fill_flag = (pen & FILL) ? 1 : 0;
	if (w-- == 0) return;
	int y0 = y;
	do
	{
		lcd_point(x, y0, pen);
		if ((y0 == y) || (y0 == y + h - 1) || fill_flag)
		{
			//for (x0 = x + 1; x0 < x + w; ++x0)
			int x0 = x + 1;
			do
			{
				lcd_point(x0, y0, pen);
			} while (++x0 < x + w);
		}
		lcd_point(x + w, y0, pen);
	} while (++y0 < y + h);
	return;
} // end lcd_rectangle
#endif


//******************************************************************************
//******************************************************************************
//	ASCII character set for LCD
//
const unsigned char cs[][5] = {
  { 0x00,0x00,0x00,0x00,0x00 },  // SP ----- -OO-- OO-OO ----- -O--- OO--O -O--- -OO--
  { 0xfa,0xfa,0x00,0x00,0x00 },  // !  ----- -OO-- OO-OO -O-O- -OOO- OO--O O-O-- -OO--
  { 0xe0,0xc0,0x00,0xe0,0xc0 },  // "  ----- -OO-- O--O- OOOOO O---- ---O- O-O-- -----
  { 0x24,0x7e,0x24,0x7e,0x24 },  // #  ----- -OO-- ----- -O-O- -OO-- --O-- -O--- -----
  { 0x24,0xd4,0x56,0x48,0x00 },  // $  ----- -OO-- ----- -O-O- ---O- -O--- O-O-O -----
  { 0xc6,0xc8,0x10,0x26,0xc6 },  // %  ----- ----- ----- OOOOO OOO-- O--OO O--O- -----
  { 0x6c,0x92,0x6a,0x04,0x0a },  // &  ----- -OO-- ----- -O-O- --O-- O--OO -OO-O -----
  { 0xc0,0xc0,0x00,0x00,0x00 },  // '  ----- ----- ----- ----- ----- ----- ----- -----
//
  { 0x7c,0x82,0x00,0x00,0x00 },  // (  ---O- -O--- ----- ----- ----- ----- ----- -----
  { 0x82,0x7c,0x00,0x00,0x00 },  // )  --O-- --O-- -O-O- --O-- ----- ----- ----- ----O
  { 0x10,0x7c,0x38,0x7c,0x10 },  // #  --O-- --O-- -OOO- --O-- ----- ----- ----- ---O-
  { 0x10,0x10,0x7c,0x10,0x10 },  // +  --O-- --O-- OOOOO OOOOO ----- OOOOO ----- --O--
  { 0x06,0x07,0x00,0x00,0x00 },  // ,  --O-- --O-- -OOO- --O-- ----- ----- ----- -O---
  { 0x10,0x10,0x10,0x10,0x10 },  // -  --O-- --O-- -O-O- --O-- -OO-- ----- -OO-- O----
  { 0x06,0x06,0x00,0x00,0x00 },  // .  ---O- -O--- ----- ----- -OO-- ----- -OO-- -----
  { 0x04,0x08,0x10,0x20,0x40 },  // /  ----- ----- ----- ----- --O-- ----- ----- -----
//
//{ 0x42,0xfe,0x02,0x00,0x00 },  // 1
  { 0x7c,0x8a,0x92,0xa2,0x7c },  // 0  -OOO- --O-- -OOO- -OOO- ---O- OOOOO --OOO OOOOO
  { 0x00,0x42,0xfe,0x02,0x00 },  // 1  O---O -OO-- O---O O---O --OO- O---- -O--- ----O
  { 0x46,0x8a,0x92,0x92,0x62 },  // 2  O--OO --O-- ----O ----O -O-O- O---- O---- ---O-
  { 0x44,0x92,0x92,0x92,0x6c },  // 3  O-O-O --O-- --OO- -OOO- O--O- OOOO- OOOO- --O--
  { 0x18,0x28,0x48,0xfe,0x08 },  // 4  OO--O --O-- -O--- ----O OOOOO ----O O---O -O---
  { 0xf4,0x92,0x92,0x92,0x8c },  // 5  O---O --O-- O---- O---O ---O- O---O O---O -O---
  { 0x3c,0x52,0x92,0x92,0x8c },  // 6  -OOO- -OOO- OOOOO -OOO- ---O- -OOO- -OOO- -O---
  { 0x80,0x8e,0x90,0xa0,0xc0 },  // 7  ----- ----- ----- ----- ----- ----- ----- -----
//
  { 0x6c,0x92,0x92,0x92,0x6c },  // 8  -OOO- -OOO- ----- ----- ---O- ----- -O--- -OOO-
  { 0x60,0x92,0x92,0x94,0x78 },  // 9  O---O O---O ----- ----- --O-- ----- --O-- O---O
  { 0x36,0x36,0x00,0x00,0x00 },  // :  O---O O---O -OO-- -OO-- -O--- OOOOO ---O- O---O
  { 0x36,0x37,0x00,0x00,0x00 },  // ;  -OOO- -OOOO -OO-- -OO-- O---- ----- ----O --OO-
  { 0x10,0x28,0x44,0x82,0x00 },  // <  O---O ----O ----- ----- -O--- ----- ---O- --O--
  { 0x24,0x24,0x24,0x24,0x24 },  // =  O---O ---O- -OO-- -OO-- --O-- OOOOO --O-- -----
  { 0x82,0x44,0x28,0x10,0x00 },  // >  -OOO- -OO-- -OO-- -OO-- ---O- ----- -O--- --O--
  { 0x60,0x80,0x9a,0x90,0x60 },  // ?  ----- ----- ----- --O-- ----- ----- ----- -----
//
  { 0x7c,0x82,0xba,0xaa,0x78 },  // @  -OOO- -OOO- OOOO- -OOO- OOOO- OOOOO OOOOO -OOO-
  { 0x7e,0x90,0x90,0x90,0x7e },  // A  O---O O---O O---O O---O O---O O---- O---- O---O
  { 0xfe,0x92,0x92,0x92,0x6c },  // B  O-OOO O---O O---O O---- O---O O---- O---- O----
  { 0x7c,0x82,0x82,0x82,0x44 },  // C  O-O-O OOOOO OOOO- O---- O---O OOOO- OOOO- O-OOO
  { 0xfe,0x82,0x82,0x82,0x7c },  // D  O-OOO O---O O---O O---- O---O O---- O---- O---O
  { 0xfe,0x92,0x92,0x92,0x82 },  // E  O---- O---O O---O O---O O---O O---- O---- O---O
  { 0xfe,0x90,0x90,0x90,0x80 },  // F  -OOO- O---O OOOO- -OOO- OOOO  OOOOO O---- -OOO-
  { 0x7c,0x82,0x92,0x92,0x5c },  // G  ----- ----- ----- ----- ----- ----- ----- -----
//
  { 0xfe,0x10,0x10,0x10,0xfe },  // H  O---O -OOO- ----O O---O O---- O---O O---O -OOO-
  { 0x82,0xfe,0x82,0x00,0x00 },  // I  O---O --O-- ----O O--O- O---- OO-OO OO--O O---O
  { 0x0c,0x02,0x02,0x02,0xfc },  // J  O---O --O-- ----O O-O-- O---- O-O-O O-O-O O---O
  { 0xfe,0x10,0x28,0x44,0x82 },  // K  OOOOO --O-- ----O OO--- O---- O---O O--OO O---O
  { 0xfe,0x02,0x02,0x02,0x02 },  // L  O---O --O-- O---O O-O-- O---- O---O O---O O---O
  { 0xfe,0x40,0x20,0x40,0xfe },  // M  O---O --O-- O---O O--O- O---- O---O O---O O---O
  { 0xfe,0x40,0x20,0x10,0xfe },  // N  O---O -OOO- -OOO- O---O OOOOO O---O O---O -OOO-
  { 0x7c,0x82,0x82,0x82,0x7c },  // O  ----- ----- ----- ----- ----- ----- ----- -----
//
  { 0xfe,0x90,0x90,0x90,0x60 },  // P  OOOO- -OOO- OOOO- -OOO- OOOOO O---O O---O O---O
  { 0x7c,0x82,0x92,0x8c,0x7a },  // Q  O---O O---O O---O O---O --O-- O---O O---O O---O
  { 0xfe,0x90,0x90,0x98,0x66 },  // R  O---O O---O O---O O---- --O-- O---O O---O O-O-O
  { 0x64,0x92,0x92,0x92,0x4c },  // S  OOOO- O-O-O OOOO- -OOO- --O-- O---O O---O O-O-O
  { 0x80,0x80,0xfe,0x80,0x80 },  // T  O---- O--OO O--O- ----O --O-- O---O O---O O-O-O
  { 0xfc,0x02,0x02,0x02,0xfc },  // U  O---- O--O- O---O O---O --O-- O---O -O-O- O-O-O
  { 0xf8,0x04,0x02,0x04,0xf8 },  // V  O---- -OO-O O---O -OOO- --O-- -OOO- --O-- -O-O-
  { 0xfc,0x02,0x3c,0x02,0xfc },  // W  ----- ----- ----- ----- ----- ----- ----- -----
//
  { 0xc6,0x28,0x10,0x28,0xc6 },  // O  O---O O---O OOOOO -OOO- ----- -OOO- --O-- -----
  { 0xe0,0x10,0x0e,0x10,0xe0 },  // Y  O---O O---O ----O -O--- O---- ---O- -O-O- -----
  { 0x86,0x8a,0x92,0xa2,0xc2 },  // Z  -O-O- O---O ---O- -O--- -O--- ---O- O---O -----
  { 0xfe,0x82,0x82,0x00,0x00 },  // [  --O-- -O-O- --O-- -O--- --O-- ---O- ----- -----
  { 0x40,0x20,0x10,0x08,0x04 },  // \  -O-O- --O-- -O--- -O--- ---O- ---O- ----- -----
  { 0x82,0x82,0xfe,0x00,0x00 },  // ]  O---O --O-- O---- -O--- ----O ---O- ----- -----
  { 0x20,0x40,0x80,0x40,0x20 },  // ^  O---O --O-- OOOOO -OOO- ----- -OOO- ----- OOOOO
  { 0x02,0x02,0x02,0x02,0x02 },  // _  ----- ----- ----- ----- ----- ----- ----- -----
//
  { 0xc0,0xe0,0x00,0x00,0x00 },  // `  -OO-- ----- O---- ----- ----O ----- --OOO -----
  { 0x04,0x2a,0x2a,0x2a,0x1e },  // a  -OO-- ----- O---- ----- ----O ----- -O--- -----
  { 0xfe,0x22,0x22,0x22,0x1c },  // b  --O-- -OOO- OOOO- -OOO- -OOOO -OOO- -O--- -OOOO
  { 0x1c,0x22,0x22,0x22,0x14 },  // c  ----- ----O O---O O---O O---O O---O OOOO- O---O
  { 0x1c,0x22,0x22,0x22,0xfc },  // d  ----- -OOOO O---O O---- O---O OOOO- -O--- O---O
  { 0x1c,0x2a,0x2a,0x2a,0x10 },  // e  ----- O---O O---O O---O O---O O---- -O--- -OOOO
  { 0x10,0x7e,0x90,0x90,0x80 },  // f  ----- -OOOO OOOO- -OOO- -OOOO -OOO- -O--- ----O
  { 0x18,0x25,0x25,0x25,0x3e },  // g  ----- ----- ----- ----- ----- ----- ----- -OOO-
//
  { 0xfe,0x10,0x10,0x10,0x0e },  // h  O---- -O--- ----O O---- O---- ----- ----- -----
  { 0xbe,0x02,0x00,0x00,0x00 },  // i  O---- ----- ----- O---- O---- ----- ----- -----
  { 0x02,0x01,0x01,0x21,0xbe },  // j  O---- -O--- ---OO O--O- O---- OO-O- OOOO- -OOO-
  { 0xfe,0x08,0x14,0x22,0x00 },  // k  OOOO- -O--- ----O O-O-- O---- O-O-O O---O O---O
  { 0xfe,0x02,0x00,0x00,0x00 },  // l  O---O -O--- ----O OO--- O---- O-O-O O---O O---O
  { 0x3e,0x20,0x18,0x20,0x1e },  // m  O---O -O--- ----O O-O-- O---- O---O O---O O---O
  { 0x3e,0x20,0x20,0x20,0x1e },  // n  O---O -OO-- O---O O--O- OO--- O---O O---O -OOO-
  { 0x1c,0x22,0x22,0x22,0x1c },  // o  ----- ----- -OOO- ----- ----- ----- ----- -----
//
  { 0x3f,0x22,0x22,0x22,0x1c },  // p  ----- ----- ----- ----- ----- ----- ----- -----
  { 0x1c,0x22,0x22,0x22,0x3f },  // q  ----- ----- ----- ----- -O--- ----- ----- -----
  { 0x22,0x1e,0x22,0x20,0x10 },  // r  OOOO- -OOOO O-OO- -OOO- OOOO- O--O- O---O O---O
  { 0x12,0x2a,0x2a,0x2a,0x04 },  // s  O---O O---O -O--O O---- -O--- O--O- O---O O---O
  { 0x20,0x7c,0x22,0x22,0x04 },  // t  O---O O---O -O--- -OOO- -O--- O--O- O---O O-O-O
  { 0x3c,0x02,0x04,0x3e,0x00 },  // u  O---O O---O -O--- ----O -O--O O-OO- -O-O- OOOOO
  { 0x38,0x04,0x02,0x04,0x38 },  // v  OOOO- -OOOO OOO-- OOOO- --OO- -O-O- --O-- -O-O-
  { 0x3c,0x06,0x0c,0x06,0x3c },  // w  O---- ----O ----- ----- ----- ----- ----- -----
//
  { 0x22,0x14,0x08,0x14,0x22 },  // x  ----- ----- ----- ---OO --O-- OO--- -O-O- -OO--
  { 0x39,0x05,0x06,0x3c,0x00 },  // y  ----- ----- ----- --O-- --O-- --O-- O-O-- O--O-
  { 0x26,0x2a,0x2a,0x32,0x00 },  // z  O---O O--O- OOOO- --O-- --O-- --O-- ----- O--O-
  { 0x10,0x7c,0x82,0x82,0x00 },  // {  -O-O- O--O- ---O- -OO-- ----- --OO- ----- -OO--
  { 0xee,0x00,0x00,0x00,0x00 },  // |  --O-- O--O- -OO-- --O-- --O-- --O-- ----- -----
  { 0x82,0x82,0x7c,0x10,0x00 },  // }  -O-O- -OOO- O---- --O-- --O-- --O-- ----- -----
  { 0x40,0x80,0x40,0x80,0x00 },  // ~  O---O --O-- OOOO- ---OO --O-- OO--- ----- -----
  { 0x60,0x90,0x90,0x60,0x00 }   // _  ----- OO--- ----- ----- ----- ----- ----- -----
//{ 0x02,0x06,0x0a,0x06,0x02 }   // _
};


