crazyman9870/Computer-Systems-MSP430/Snake/RBX430_lcd.c
//******************************************************************************
//	set lcd cursor position
//
//	Description: set the position at which the next character will be printed.
//
uint8 lcd_cursor(int16 x, int16 y)
{
	lcd_x = ((x >= 0) && (x < HD_X_MAX)) ? x : HD_X_MAX-1;
	lcd_y = ((y >= 0) && (y < HD_Y_MAX)) ? y : HD_Y_MAX-1;
	return 0;
} // end lcd_cursor


//******************************************************************************
//	write 8-bit data to LCD
//
//	lcd_x = column
//	lcd_y = lower left-hand corner
//
void lcd_WD(uint8 datum)
{
	int i = 0x80;
	uint8 y = lcd_y + CHAR_SIZE;

	if (lcd_dmode & LCD_REVERSE_FONT) datum = ~datum;
	do
	{
		--y;							// move down dolumn
		if (i & datum)
		{
			lcd_point(lcd_x, y, 1);		// always turn point on
		}
		else
		{
			if (!(lcd_dmode & LCD_OR_CHAR))
				lcd_point(lcd_x, y, 0);	// turn off pixel
		}
	} while (i >>= 1);
	if (++lcd_x >= HD_X_MAX) lcd_x = 0;	// handle wrap-around
	return;
} // end lcd_WD


void lcd_WD2(uint16 datum)
{
	uint8 saved_lcd_y = lcd_y;			// save lcd_y

	lcd_y += CHAR_SIZE;
	if (lcd_y >= HD_Y_MAX) lcd_y -= 256 - HD_Y_MAX;
	lcd_WD(datum >> 8);
	lcd_x = lcd_x ? lcd_x - 1 : HD_X_MAX;

	lcd_y = saved_lcd_y;				// restore lcd_y
	lcd_WD(datum & 0x00ff);
	return;
} // end lcd_WD2


//******************************************************************************
//	write character to LCD
//
unsigned char lcd_putchar(unsigned char c)
{
	char_cnt++;							// increment # of characters
	if (c < ' ')
	{
		switch (c)
		{
			case '\a':
			{
				lcd_dmode |= LCD_REVERSE_FONT;
				break;
			}

			case '\b':
			{
				lcd_dmode |= LCD_2X_FONT;
				break;
			}

			case '\t':
			{
				lcd_dmode |= LCD_PROPORTIONAL;
				break;
			}

			case '\n':
			{
				// decrement lcd_y by CHAR_SIZE or CHAR_SIZE*2
				lcd_y -= (lcd_dmode & LCD_2X_FONT ? 2 : 1) << 3;
				if (lcd_y >= HD_Y_MAX) lcd_y -= 256 - HD_Y_MAX;
			}

			case '\r':
			{
				lcd_x = 0;
				break;
			}

			case '\v':
			{
				lcd_dmode |= LCD_OR_CHAR;
				break;
			}

			default:
				break;
		}
	}
	else
	{
		// output character
		if (c <= '~')
		{
			uint16 i = 0;
			unsigned char cc = c - ' ';
			if (lcd_dmode & LCD_2X_FONT)	// 2x Font
			{
				do
				{
					unsigned char ccs = cs[cc][i];
					unsigned char mask1 = 0x01;
					unsigned int mask2 = 0x0003;
					unsigned int data = 0;

					do
					{	// double bits into data
						if (ccs & mask1) data |= mask2;
						mask1 <<= 1;
						mask2 <<= 2;
					} while (mask1);
					lcd_WD2(data);
					lcd_WD2(data);
					if (++i && (lcd_dmode & LCD_PROPORTIONAL) && !cs[cc][i]) break;
				} while (i < 5);
				lcd_WD2(0x0000);			// trailing space
				lcd_WD2(0x0000);
			}
			else							// 1x font
			{
				do							// 5 8-bit columns
				{
					lcd_WD(cs[cc][i]);		// output character
					if (++i && (lcd_dmode & LCD_PROPORTIONAL) && !cs[cc][i]) break;
				} while (i < 5);
				lcd_WD(0x00);				// trailing space
			}
		}
	}
	return c;
} // end my_putchar

#if LCD_PRINTF
//******************************************************************************
//	formatted output of characters and integers
//
//	format specifier: %[flags][width][.precision][length]specifier
//
//	Supported specifiers:
//		%d or %i	Signed decimal integer
//		%u			Unsigned decimal integer
//		%x or %X	Unsigned hexadecimal integer
//		%c			Character
//		%s			String
//
//	Supported sub-specifier flags/width/length:
//		0			Left-pads numbers with zeros(0) instead of spaces
//		l			Long (32-bits)
//		h			Char (8-bits)
//
//	Supported control characters:
//		'\a'		Reverse font
//		'\b'		2x Font
//		'\t'		Proportional font
//		'\n'		New Line
//		'\r'		Return
//		'\v'		OR character to display
//
//	Possible for future releases:
//		-			Left-justify within field
//		+			+ or - sign
//		sp			- sign
//		#			Minimum number of characters to be printed
//
//	Max sizes:
//		uint32	0xffffffff = 4294967296 = 32 bit unsigned max
//		uint16	0xffff = 65535 = 16 bit unsigned max
//		~ is a degree symbol
//
static int my_printfi(unsigned char (*outc)(unsigned char), char* fmt, char* arg_ptr)
{
	static const char lHexChar[] = "0123456789abcdef";
	static const char uHexChar[] = "0123456789ABCDEF";
	static const unsigned long dv[] =
		{ 1000000000, 100000000, 10000000, 1000000, 100000, 10000, 1000, 100, 10, 1, 0 };
	unsigned char c;

	char_cnt = 0;							// clear character counter
	while (c = *fmt++)						// get character from format string
	{
		if (c == '%')
		{
			int16 length = 4;				// length: 2 = char, 4 = int, 8 = long
			int16 fieldSize = 0;			// field size
//			uint8 padChar = '0';			// width: pad character
			uint8 padChar = ' ';			// width: pad character
			int8 hexCase = 0;				// hexadecimal: 0 = upper, 1 = lower
			while (1)
			{
				switch (c = *fmt++)
				{
					case'0':				// pad w/zeros modifier
						padChar = '0';
						continue;

					case'1':
					case'2':
					case'3':
					case'4':
					case'5':
					case'6':
					case'7':
					case'8':
					case'9':				// field size modifier
					{
						fieldSize = 0;
						do
						{
							fieldSize = fieldSize * 10 + c - '0';
//							fieldSize = (((fieldSize << 2) + fieldSize) << 1) + c - '0';
							c = *fmt++;
						} while (c >= '0' && c <= '9');
						--fmt;
						continue;
					}

					case 's':				// string
					{
						char* _ptr = va_arg(arg_ptr, char*);
						while (strlen(_ptr) < fieldSize--) (*outc)(' ');
						while (*_ptr) (*outc)(*_ptr++);
						break;
					}

					case 'c':				// char
						while (1 < fieldSize--) (*outc)(padChar);	// pad char??
						(*outc)(va_arg(arg_ptr, char));
						break;

					case 'd':				// 16-bit integer
					case 'i':				// 16-bit integer
					case 'u':				// 16-bit unsigned
					{
						unsigned long nn, d;					// temp variables
						unsigned long* dp = (unsigned long*)dv;	// pointer to powers of 10
						int size = 10;							// max size

						// get value as signed long (int32)
						long n = (long)(length > 4 ? va_arg(arg_ptr, long)
													: va_arg(arg_ptr, int));

