crazyman9870/Computer-Systems-MSP430/Snake/RBX430_lcd.c
						if (n == 0)
						{
							while (1 <= --fieldSize) (*outc)(padChar);
							(*outc)('0');
						}
						else
						{
							// if signed and negative, negate, reduce field, and set flag
							if (c != 'u' && n < 0) n = -n, fieldSize--, (*outc)('-');

							// reduce size by # of digits & output padding (if any)
							while ((unsigned long)n < *dp) ++dp, --size;
							while (size <= --fieldSize) (*outc)(padChar);

							nn = (unsigned long)n;				// output #
							do									// output decimal #
							{
								d = *dp++;						// get power of 10
								c = '0';						// start with '0'
								while (nn >= d) ++c, nn -= d;	// get digit
								(*outc)(c);						// output digit
							} while (!(d & 1));					// repeat until 1
						}
						break;
					}

					case 'h':				// char modifier
						length = 2;
						continue;

					case 'l':				// long modifier
						length = 8;
						continue;

					case 'x':				// lower case hexadecimal
						hexCase = 1;

					case 'X':				// upper case hexadecimal
					{
						unsigned long d = (unsigned long)(length > 4 ? va_arg(arg_ptr, long) : va_arg(arg_ptr, int));

						if (fieldSize && (length > fieldSize)) length = fieldSize;
						else

						while (length < fieldSize--) (*outc)(padChar);
						do
						{
							c = (unsigned char)(d >> (--length << 2)) & 0x0f;
							(*outc)(hexCase ? lHexChar[c] : uHexChar[c]);
						} while (length);
						break;
					}

					default:				// undefined conversion
						(*outc)(c);

					case 0:					// single % ????
						break;
				}
				break;						// finished specifier, next
			}
		}
		else (*outc)(c);					// character in format string
	}
	return 0;
} // end my_printfi


//******************************************************************************
//	formatted print to lcd
//
//	return # of characters sent to lcd_putchar
//
int lcd_printf(const char* fmt, ...)
{
	unsigned char (*outchar)(unsigned char c);
	uint8 saved_lcd_dmode = lcd_dmode;		// save font mode
	outchar = lcd_putchar;					// use putchar
	va_list arg_ptr;
	va_start(arg_ptr, fmt);					// create pointer to args
	my_printfi(outchar, (char*)fmt, arg_ptr);
	va_end(arg_ptr);						// destroy arg pointer
	lcd_dmode = saved_lcd_dmode;			// restore font mode
	return char_cnt;						// return character count
} // end lcd_printf


//******************************************************************************
//	formatted printf to buffer
//
//	return # of characters sent to buffer
//
static unsigned char outChar(unsigned char c)
{
	char_cnt++;
	*buffer_ptr++ = c;
	*buffer_ptr = 0;
	return c;
} // end outChar

int lcd_sprintf(char* buffer, const char* fmt, ...)
{
	unsigned char (*outchar)(unsigned char c);
	outchar = outChar;						// use outChar
	buffer_ptr = buffer;
	va_list arg_ptr;
	va_start(arg_ptr, fmt);					// create pointer to args
	my_printfi(outchar, (char*)fmt, arg_ptr);
	va_end(arg_ptr);						// destroy arg pointer
	return char_cnt;						// return character count
} // end lcd_sprintf
#endif

//******************************************************************************
//	override fputs and fputc in stdio library
//
int fputs(const char *_ptr, register FILE *_fp)
{
	while (*_ptr) lcd_putchar(*_ptr++);	// output string
	return 1;
} // end fputs

int fputc(int _c, register FILE *_fp)
{
	lcd_putchar(_c);					// output character
	return _c;
} // end fputc
